#!/usr/bin/env python
#-*- coding:utf-8 -*-
"""
说明：
前景色         背景色           颜色
---------------------------------------
30                40              黑色
31                41              红色
32                42              绿色
33                43              黃色
34                44              蓝色
35                45              洋红
36                46              青色
37                47              白色
显示方式             　 意义
----------------------------------
0                    终端默认设置
1                    高亮显示
22　　　　　　　　　　　非高亮显示
4                    使用下划线
24　　　　　　　　　　　去下划线
5                    闪烁
25　　　　　　　　　　　去闪烁
7                    反白显示
27　　　　　　　　　　　非反显
8                    不可见
28　　　　　　　　　　　可见

例：
\033[1;32;41m   #---1-高亮显示 31-前景色绿色  40-背景色红色---
\033[0m         #---采用终端默认设置，即缺省颜色---
"""

print('\033[0m这是显示方式0')
print('\033[1m这是显示方式1')
print('\033[4m这是显示方式4')
print('\033[5m这是显示方式5')
print('\033[7m这是显示方式7')
print('\033[8m这是显示方式8')
print('\033[30m这是前景色0')
print('\033[31m这是前景色1')
print('\033[32m这是前景色2')
print('\033[33m这是前景色3')
print('\033[34m这是前景色4')
print('\033[35m这是前景色5')
print('\033[36m这是前景色6')
print('\033[37m这是前景色7')
print('\033[40m这是背景色0')
print('\033[41m这是背景色1')
print('\033[42m这是背景色2')
print('\033[43m这是背景色3')
print('\033[44m这是背景色4')
print('\033[45m这是背景色5')
print('\033[46m这是背景色6')
print('\033[47m这是背景色7')

print('\033[1;31;40m')     #下一目标输出背景为黑色，颜色红色高亮显示
print('*' * 50)
print('\033[7;31m错误次数超限，用户已被永久锁定，请联系管理员！\033[1;31;40m')  #字体颜色红色反白处理
print('*' * 50)
print('\033[0m')


print("前景色：")
print("\033[0;30;40m\t方倍实验室\033[0m")
print("\033[0;31;40m\t方倍实验室\033[0m")
print("\033[0;32;40m\t方倍实验室\033[0m")
print("\033[0;33;40m\t方倍实验室\033[0m")
print("\033[0;34;40m\t方倍实验室\033[0m")
print("\033[0;35;40m\t方倍实验室\033[0m")
print("\033[0;36;40m\t方倍实验室\033[0m")
print("\033[0;37;40m\t方倍实验室\033[0m")